---
title: ConduitSizeIterator
classe: Autodesk.Revit.DB.Electrical.ConduitSizeIterator
namespace: Autodesk.Revit.DB.Electrical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# ConduitSizeIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ConduitSize Current { get; }` | `conduitSizeIterator.Current` | ConduitSize |
| `Boolean IsValidObject { get; }` | `conduitSizeIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `conduitSizeIterator.Dispose()` | Void |
| `ConduitSize GetCurrent()` | `conduitSizeIterator.GetCurrent()` | ConduitSize |
| `Boolean HasCurrent()` | `conduitSizeIterator.HasCurrent()` | Boolean |
| `Boolean IsDone()` | `conduitSizeIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `conduitSizeIterator.MoveNext()` | Boolean |
| `Void Reset()` | `conduitSizeIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```